app/Controllers/TaskControll.php

    public function index()
    {
        $tombolcari = $this->request->getPost('tombolcari');
        if (isset($tombolcari)) {
            $cari = $this->request->getPost('cari');
            redirect()->to('/Mentor/index');
        } else {
            $cari = session()->get('cari_judul');
        }

        $datamentor = $cari ? $this->mentormodel->cariData($cari) ->paginate(5, 'mentor') : $this->mentormodel->paginate(5, 'mentor');
---
SELECT *
FROM `mentor`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `mentor`

    public function mentor(){
        $tampil = $this->mentormodel->findAll();
---
SELECT *
FROM `mentor`

            public function delete($id)
            {
                $this->mentormodel->delete($id);
---
DELETE FROM `mentor`
WHERE `id` IN ('2')

    public function Testi(){
        $tampildata = $this->testimodel->findAll();
---
SELECT *
FROM `testi`