app/Controllers/User.php

SELECT *
FROM `mentor`
---
public function Create(){

  $tampildata = $this->bimbelmodel->joinToMentor()->findAll();
        $mentorModel = new MentorModel();
        $data = ['tampildata'=>$tampildata,
    'mentor'=> $mentorModel->findAll()];