app/Models/MentorModel.php

SELECT *
FROM `mentor`
WHERE `alias` = 'akmal'
 LIMIT 1
---
      public function getmentor($alias = false)
      {

          if ($alias == false) {
              return $this->findAll();
          }
          return $this->where(['alias' => $alias])->first();